---
type: ElementLogicalFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementLogicalFilter

`Autodesk.Revit.DB.ElementLogicalFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFilters | 2019 | `public IList < ElementFilter > GetFilters ()` |
| Method | PassesFilter | — | `` |
| Method | SetFilters | 2020 | `public void SetFilters ( IList < ElementFilter > filters )` |